// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Ovaj softver mora biti instaliran na volumen sa kojeg se pokreće.";
"ERROR_INSTALL" = "Ovaj volumen ne ispunjava uslove za ovu nadogradnju.";

"Newer_Package_Installed_message" = "Nova verzija Chameleona već je instalirana";
"Intel_Mac_message" = "Ovaj softver ne može biti instaliran na ovom računaru";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Tip instalacije";
"InstallType_description" = "Odaberite za obavljanje nove instalacije ili za nadogradnju postojeće instalacije.";

"New_title" = "Nova instalacija";
"New_description" = "Rezerva za postojeći /Extra folder, ako je pronađen na ciljanoj particiji. Novi će biti stvoren ako izaberete bilo koju opciju u instaleru, osim Bootloadera.";

"Upgrade_title" = "Nadogradnja";
"Upgrade_description" = "Spaja postojeći /Extra folder, ako je pronađen na ciljanoj particiji, sa svim opcijama izabranim iz instalera, osim Bootloadera.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon zahtjeva tri bitna fajla. (pojednostavljeno rečeno)
boot0 (MBR na disk pogonu) odgovoran za učitavanje boot1.
boot1 (Na particiju za boot-sektor) za pronalaženje boot2.
boot2 (Na particiju za root direktorij) za učitavanje Kernela itd.";

"Standard_title" = "Standard";
"Standard_description" = "instalira Chameleon fajlove u početnu datoteku diska (root) odabrane particije koristeći bilo boot0 ili boot0md u zavisnosti od vašeg sistema ne uništavajući bilo kakvu Winodws instalaciju ukoliko je imate instaliranu.";

"EFI_title" = "EFI";
"EFI_description" = "Instalira Chameleon fajlove za normalno skrivenu particiju EFI koristeći bilo boot0 ili boot0md u zavisnosti od vašeg sistema ne uništavajući bilo kakvu Winodws instalaciju ukoliko je imate instaliranu.";

"noboot_title" = "Ne instaliraj Bootloader";
"noboot_description" = "Korisno ukoliko želite instalirati samo extra.";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Chameleon Moduli";
"Module_description" = "Moduli ugrađeni u sistem Cameleona omogućavaju korisniku ili programeru proširenje funkcionalnosti Cameleon jezgre bez zamijene glavnog boot fajla. ";

"klibc_title" = "klibc";
"klibc_description" = "Ovaj modul omogućava standard c biblioteku za module za povezivanje ako chameleon biblioteka nije dovoljna.
Ovo se trenutno koristi samo sa uClibc++ bibliotekom.
Izvor: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Rezolucija";
"AutoReso_description" = "Ovaj modul čita edid informacije sa monitora priključenog na glavni ekran.
Modul trenutno nije integrisan u trunk i nije od velike primjene kao što stoji.
Osim toga, modul će zakrpati VESA modove koji su prisutni u pred Intelovim HD grafičkim karticama kako bi osigurale odgovarajuću rezoluciju ekrana prilikom podizanja.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Ovaj modul omogućava minimalističku c++ runtime biblioteku za korištenje u drugim modulima.
To ne pruža funkcionalnost sama po sebi, umjesto toga, služi kako bi se omogućilo korištenje c++ jezika u ostalim modulima.
Imajte na umu da su obe RTTI iznimke onemogućene.
Izvor: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Raspored tipki";
"Keylayout_description" = "Ovaj modul omogućava korisniku da definira mapiranje tipki na tastaturi.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Korisno";
"Utility_description" = "Menij fajlovi za pomoć pri instalaciji";

"PrefPanel_title" = "Preferens Ploča";
"PrefPanel_description" = "Instalira Preferens ploču za Chameleon.";

"SMBIOSDefault_title" = "SMBIOS.plist";
"SMBIOSDefault_description" = "Kopira primjer smbios.plist u /Extra/Configuration.";

"Documentation_title" = "Documentacija";
"Documentation_description" = "Dokumentacija za Chameleon priručnik, instaliranje i korištenje";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Boot Opcije";
"Options_description" = "Kreira /Extra/org.chameleon.Boot.plist i omogučava izbor željene opcije za kontrolu Chameleon postavki.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Skriva Cameleon boot banner u grafičkom korisničkom inferfejsu (GUI).";

"GUI_title" = "GUI=No";
"GUI_description" = "Onemogućava uključeni zadani korisnički grafički interfejs.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Koristite legacy (sivi i bijeli) apple logo prilikom podizanja radije nego boot.png sliku iz teme";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Prikaz zaslona za odabir particije bez prikazivanja timeout ekrana.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Omogućava mod mirnog pokretanja (bez poruka ili redaka).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Onemogućava prikaz detalja o particiji i rezoluciji.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pauzira boot proces nakon što je Cameleon završio postavljanje, onda čeka na pritisak tipke prije nego se pokrene mach kernel. Korisno u kombinaciji sa verbose podizanjem za riješavanje problema.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Pokreće jezgru (kernel) u 32bitnom modu radije nego u zadanom 64bitnom modu.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Omogućava opciju za popravak bilo kojih EHCI vlasničkih prava zbog lošeg biosa.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Omogućava mogućnost dodavanja "ugrađeno" na vaše Ethernet uređaje.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Omogućava HPET na Intel čipsetima, za biose koje ne uključuju ovu opciju.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Ova opcija omogućava vam da zaobiđete loše uspavane slike (sleep images).";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Isključuje automatsko omogućavanje restart fix opcije";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Omogućava opciju za reset UHCI kontrolera prije početka podizanja. ";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Isključuje omogućeno automatsko RAM prepoznavanje.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Samo za Lion. Omogućava učitavanje prethodno povezanog kernela. Ovo će ignorisati /E/E i /S/L/E. Ovo koristiti samo ako morate znati da sadrži sve što vam je potrebno.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Pokušava da učita uspavanu sliku snimljenu iz prethodne hibernacije";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Nova C-state _CST generacija metodom SystemIO registracije umjesto FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Odbacuje SSDT tablice ugrađene na matičnoj ploči.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Uključuje posebno Processorsko stanje napajanja, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Uključuje posebno Processorsko stanje napajanja, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Uključuje posebno Processorsko stanje napajanja, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Uključuje automatsko generisanje procesora u stanju mirovanja (C-States).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Omogućava automatsko generisanje snage procesora stanja performansi (P-States).";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Postavite Grafički Mod na 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Postavite Grafički Mod na 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Postavite Grafički Mod na 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Postavite Grafički Mod na 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Postavite Grafički Mod na 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Postavite Grafički Mod na 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Postavite Grafički Mod na 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Postavite Grafički Mod na 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Postavite Grafički Mod na 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Postavite Grafički Mod na 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Postavite Grafički Mod na 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Omogućava opciju auto prepoznavanja NVIDIA baziranih grafičkih video kartica i upisuje pravilne informacije o istoj.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Uključuje UseAtiROM opciju.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Uključuje UseNvidiaROM opciju.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Uključuje VBIOS opciju";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Uključuje verbose prijavu i omogućava vam da vidite poruke iz oba Chameleon i kernel OS X prilikom pokretanja. Osnova za rješavanje problema.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "Opcija za rješavanje problema koja se koristi za dizanje OS X BSD / Unix komandnog reda.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Opcija koja nije potrebna za svakodnevno podizanje, ali može biti korisna ako želite da OS X učita sve fajlove iz sistemskog direktorija, radije nego se oslanjajući na pre-izgrađenu predmemoriju.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Postavlja zastave npci = 0x2000 za Kernel Zastave";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Samo Lion. Isključuje 'low power wake' opciju koja ponekad ostavi crni ekran posije buđenja iz spavanja.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Korištenje tastature za Njemačku Mac tastaturu";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Korištenje tastature za Španjolsku Mac tastaturu";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Korištenje tastature za Francusku Mac tastaturu";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Korištenje tastature za Italijansku Mac tastaturu";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Korištenje tastature za Svedsku Mac tastaturu";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Korištenje tastature za Francusku PC tastaturu";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Manja, jednostavnija verzija nove zadane teme koja se koristi prilikom izgradnje Chameleon-a koji zahtjeva ugrađenu temu. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleonova prethodno zadana tema.";

"Default_title" = "Standard";
"Default_description" = "Chameleonova trenutno zadana tema.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Predivna jednostavna tema od NoSmokingBandit iz Aprila 2009.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Opcije za kontrolu rada Chameleona.";

// General
"General_title" = "General Options";
"General_description" = "Izaberite od selekcije iz baze opcija.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Izaberite od selekcije iz kernel zastava.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "Odabir opcija koje se bave upravljanjem potrošnjom energije i SpeedStepom.";

// Resolution
"Resolution_title" = "Resolution";
"Resolution_description" = "Postavlja rezoluciju ekrana za vaš monitor";

// Video
"Video_title" = "Video";
"Video_description" = "Odabir opcija koje se bave s videom.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Postavite jedan keylayout za korištenje, ili odaberite "None" ako ne želite odabrati keylayout.";

// Themes
"Themes_title" = "Themes";
"Themes_description" = "Skup predloženih tema
Više tema možete pronaći na http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Odabir bez rezolucije.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Odabir bez keylayouta.";
